{
  "partners" : [ {
    "logos" : [ {
      "logoUrl" : "../images/logos/google.svg",
      "name" : "Google",
      "url" : "https://www.google.com.ua/intl/en/about/"
    } ],
    "title" : "Event Partner"
  }, {
    "logos" : [ {
      "logoUrl" : "../images/logos/kroger-technology.svg",
      "name" : "Kroger Technology",
      "url" : "https://www.kroger.com/LiveKT/"
    } ],
    "title" : "Gold Partner"
  }, {
    "logos" : [ {
      "logoUrl" : "../images/logos/illumination-works.png",
      "name" : "Illumination Works",
      "url" : "http://www.illuminationworksllc.com/"
    }, {
      "logoUrl" : "../images/logos/callibrity.svg",
      "name" : "Callibrity",
      "url" : "http://www.callibrity.com/"
    }, {
      "logoUrl" : "../images/logos/AWH.svg",
      "name" : "AWH",
      "url" : "http://awh.net/"
    } ],
    "title" : "Silver Partner"
  }, {
    "logos" : [ {
      "logoUrl" : "../images/logos/columbus_collaboratory.png",
      "name" : "Columbus Collaboratory",
      "url" : "http://columbuscollaboratory.com/"
    } ],
    "title" : "Copper Partner"
  }, {
    "logos" : [ {
      "logoUrl" : "../images/logos/gdg_cincinnati.png",
      "name" : "GDG Cincinnati",
      "url" : "https://www.meetup.com/cincy-android/"
    }, {
      "logoUrl" : "../images/logos/gdg_columbus.png",
      "name" : "GDG Columbus",
      "url" : "https://www.meetup.com/GDG-Columbus/"
    } ],
    "title" : "Organizers"
  } ],
  "speakers" : [ null, {
      "bio" : "An experienced developer, start-up founder, and international speaker, Abraham Williams brings a broad range of skills to his current role as a senior developer at Bendyworks. A top 1% contributor at Stack Overflow and an active member of Google Developer Groups, Abraham has been recognized by Google as a Developer Expert for his ability to identify technology problems and provide quality solutions in the community.",
      "company" : "Bendyworks",
      "country" : "Madison, WI",
      "featured" : true,
      "id" : 1,
      "name" : "Abraham Williams",
      "photoUrl" : "/images/people/abraham_williams.jpg",
      "shortBio" : "An experienced developer, start-up founder, and international speaker, Abraham Williams brings a broad range of skills to his current role as a senior developer at Bendyworks...",
      "socials" : [ {
        "icon" : "gplus",
        "link" : "https://plus.google.com/114233674199568482864",
        "name" : "Google Plus"
      }, {
        "icon" : "twitter",
        "link" : "https://twitter.com/abraham",
        "name" : "Twitter"
      } ]
    }, {
      "bio" : "Benjamin Baxter grew up in Cincinnati and moved to San Jose, California. He has been developing with Android since 🍩 (how far we have come). He worked at Kroger on their Android App before leaving to join Google to work on Android TV Developer Relations. 📺 For a cheese coney (Oh how he misses those 🌭), he will gladly talk Android with you. 😀 ",
      "company" : "Google",
      "companyLogo" : "/images/logos/google.svg",
      "country" : "San Jose, CA",
      "featured" : true,
      "id" : 2,
      "name" : "Benjamin Baxter",
      "photoUrl" : "/images/people/benjamin_baxter.png",
      "shortBio" : "Benjamin Baxter works for Google in Mountain View, California. He is on the Developer Relations team for Android TV...",
      "socials" : [ {
        "icon" : "gplus",
        "link" : "https://plus.google.com/115314784213798316744",
        "name" : "Google Plus"
      }, {
        "icon" : "twitter",
        "link" : "https://twitter.com/benjamintravels",
        "name" : "Twitter"
      } ]
    }, {
      "bio" : "Wesley Workman is Software Architect at Batterii. He's spent the past 5 years building a cutting edge application on GCP at Batterii. Batterii is a collaborative platform built to assist users who are conducting design research and design thinking activities.",
      "company" : "Batterii",
      "country" : "Maineville, OH",
      "featured" : true,
      "id" : 3,
      "name" : "Wesley Workman",
      "photoUrl" : "/images/people/wesley_workman.jpg",
      "shortBio" : "Wesley Workman is Software Architect at Batterii. He's spent the past 5 years building a cutting edge application on GCP at Batterii...",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/workmanw",
        "name" : "Twitter"
      } ]
    }, {
      "bio" : "Eric Maxwell is a Product Engineer at Realm and co-organizer of the Columbus Kotlin User Group. He has spent over a decade architecting and developing software for various companies across many industries. He has developed and taught courses on Java, Android and iOS. When he’s not working, he enjoys time with family, traveling and improv comedy.",
      "company" : "Realm",
      "country" : "Columbus, OH",
      "featured" : true,
      "id" : 4,
      "name" : "Eric Maxwell",
      "photoUrl" : "/images/people/eric_maxwell.jpg",
      "shortBio" : "Eric Maxwell is a Product Engineer at Realm and co-organizer of the Columbus Kotlin User Group...",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/emmax",
        "name" : "Twitter"
      } ]
    }, {
      "bio" : "Aaron Rietschlin is an Android developer who has been working on Android since 2010. He has published over 20 applications to the Google Play Store and is currently an Android Developer at JPMorgan Chase.",
      "company" : "JPMorgan Chase",
      "country" : "Columbus, OH",
      "featured" : true,
      "id" : 5,
      "name" : "Aaron Rietschlin",
      "photoUrl" : "/images/people/aaron_rietschlin.jpg",
      "shortBio" : "Aaron Rietschlin is an Android developer who has been working on Android since 2010...",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/AaronRietschlin",
        "name" : "Twitter"
      } ]
    }, {
      "bio" : "Jim is a software developer from Columbus, OH with Pillar Technology.  He's worked on a variety of projects ranging from agriculture software to scientific search engines and mobile marketing apps.  This basically means he's had the opportunity to make a lot of mistakes along the way, and he doesn't mind sharing what he's learned.  When he isn't writing code Jim enjoys cooking, reading (mostly fantasy and sci-fi), and spending time with his family.",
      "company" : "Pillar Technology",
      "country" : "Columbus, OH",
      "featured" : true,
      "id" : 6,
      "name" : "Jim Kirkbride",
      "photoUrl" : "/images/people/james_kirkbride.jpeg",
      "shortBio" : "Jim is a software developer from Columbus, OH with Pillar Technology...",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/jameskbride",
        "name" : "Twitter"
      } ]
    }, {
      "bio" : "Ezgi is a PhD Student at the College of Pharmacy at Ohio State University. She works with large scale genomic and clinical datasets to determine the factors affecting the leukemia patient survival following bone marrow transplants. She mostly uses R for her analyses but she also uses bash/shell very frequently as she works on the HPC cluster on a daily basis. Ezgi is also one of the organizers of the R-Ladies Columbus chapter. She received her undegraduate degree in Biology in Turkey, where she's originally from. She then switched to Bioinformatics and joined a dual degree master's program, where she received an MS in Systems Biology degree from the University of Luxembourg and an MS in Cancer Biology from the University at Buffalo and Roswell Park Cancer Institute.",
      "company" : "Ohio State University",
      "country" : "Columbus, OH",
      "featured" : true,
      "id" : 7,
      "name" : "Ezgi Karaesmen",
      "photoUrl" : "/images/people/ezgi_karaesmen.jpg",
      "shortBio" : "Ezgi is a PhD Student at the College of Pharmacy at Ohio State University. She works with large scale genomic and clinical datasets...",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/e_Karaesmen",
        "name" : "Twitter"
      } ]
    }, {
      "bio" : "Katie Sasso is a Data Scientist at the Columbus Collaboratory. She studied at the Ohio State University to receive a Ph.D. in Experimental Psychology. Katie is passionate about integrating background in personality research, statistics, experimental methods, and data analysis in order to answer challenging questions and promote process improvement.",
      "company" : "Columbus Collaboratory",
      "country" : "Columbus, OH",
      "featured" : true,
      "id" : 8,
      "name" : "Katie Sasso",
      "photoUrl" : "/images/people/katie_sasso.jpg",
      "shortBio" : "Katie Sasso is a Data Scientist at the Columbus Collaboratory...",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/KatieSasso",
        "name" : "Twitter"
      } ]
    }, {
      "bio" : "Taron Foxworth is focused on one question: How do we create more engineers? Taron is a hardware hacker and the Developer Evangelist at Losant. His goal is to translate technology for people to learn, love, and be inspired. Taron is currently interesting in IoT, Blockchain, Node.js, functional programming, and other really random things. ",
      "company" : "Losant",
      "country" : "Cincinnati, OH",
      "featured" : true,
      "id" : 9,
      "name" : "Taron Foxworth",
      "photoUrl" : "/images/people/taron_foxworth.jpg",
      "shortBio" : "Taron Foxworth is focused on one question: How do we create more engineers?...",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/anaptfox",
        "name" : "Twitter"
      } ]
    }, {
      "bio" : "Martha Lindeman is a usability consultant who for 25+ years has provided design input for many different types of systems and environments. She received her Bachelor's from Ohio State and her Ph.D. from Harvard University, focusing first on the mind-body relationship and then on how people's cognitive processes can be simulated by computer models.  Her latest projects involve designing for virtual reality (VR), augmented reality (AR), and mixed reality (MR). She is passionate about making systems and the process to create them both easy to learn and easy to use.",
      "company" : "Agile Interactions",
      "country" : "Columbus, OH",
      "featured" : true,
      "id" : 10,
      "name" : "Martha Lindeman",
      "photoUrl" : "/images/people/martha_lindeman.jpg",
      "shortBio" : "Martha Lindeman is a usability consultant who for 25+ years has provided design input for many different types of systems and environments...",
      "socials" : [ {
        "icon" : "linkedin",
        "link" : "https://www.linkedin.com/in/marthalindeman/",
        "name" : "LinkedIn"
      } ]
    }, {
      "bio" : "Doug is a Principal Consultant at Improving Enterprises in Columbus Ohio.  He started developing software as a high school freshman on a TRS-80 16K.  He loved programming so much that he decided to get a BSCIS from Ohio State University.  Since then he has developed software for Graphics Kiosks, Rules Engines, Specialized Hardware and ASP.Net websites.  Over the last several years, he has helped grow the Windows Developer Community in Central Ohio.  He spends his free time developing Windows applications and Unity games.",
      "company" : "Improving Enterprises",
      "country" : "Westerville, OH",
      "featured" : true,
      "id" : 11,
      "name" : "Doug Mair",
      "photoUrl" : "/images/people/doug_mair.jpg",
      "shortBio" : "Doug is a Principal Consultant at Improving Enterprises in Columbus Ohio...",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/Doug_Mair",
        "name" : "Twitter"
      } ]
    }, {
      "bio" : "Michael Pinnegar is a senior developer and currently employed at Chemical Abstracts as a software developer, devops expert, and team lead. His favorite programming language is Java (static typing woo!), and his experience is mainly in webstack applications. When not coding Michael enjoys playing Magic: The Gathering, tons of games on Steam, and teaching others when he can.",
      "company" : "Chemical Abstracts",
      "country" : "Columbus, OH",
      "featured" : true,
      "id" : 12,
      "name" : "Michael Pinnegar",
      "photoUrl" : "/images/people/michael_pinnegar.png",
      "shortBio" : "Michael Pinnegar is a senior developer and currently employed at Chemical Abstracts as a software developer, devops expert, and team lead...",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/Jazzepi",
        "name" : "Twitter"
      } ]
    }, {
      "bio" : "Marlena Bowen is a Mobile Developer at Root Car Insurance.",
      "company" : "Root Car Insurance",
      "country" : "Columbus, OH",
      "featured" : true,
      "id" : 13,
      "name" : "Marlena Bowen",
      "photoUrl" : "/images/people/marlena_bowen.jpg",
      "shortBio" : "Marlena Bowen is a Mobile Developer at Root Car Insurance.",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/marlenacodes",
        "name" : "Twitter"
      } ]
    }, {
      "bio" : "Mike traded in a decade of full stack development for Wall Street for mobile development. Since then he has worked on native iOS & Android apps for large corporations and startups. He's developed Hillary 2016 for Android, games for Ringling Bro's Circus and apps for the last Twitter Flight conference. Currently he's working on enterprise iOS apps for the New York Yankees. He's beat stage 3 cancer twice and always looks to give back to the tech community by speaking at local meetups or organizing and sponsoring DevFest Florida.",
      "company" : "Traversoft",
      "country" : "Tampa, FL",
      "featured" : true,
      "id" : 14,
      "name" : "Mike Traverso",
      "photoUrl" : "/images/people/mike_traverso.jpg",
      "shortBio" : "Mike traded in a decade of full stack development for Wall Street for mobile development. Since then he has worked on native iOS & Android apps for large corporations and startups.",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/traversoft",
        "name" : "Twitter"
      } ]
    }, {
      "bio" : "Pearl Latteier is a software engineer at Bendyworks in Madison WI, a Google Developer Expert in web technologies, and co-organizer of Madison’s Google Developer Group. She builds JavaScript applications for web and mobile, and she has spoken at conferences around the world on topics including Progressive Web Apps, Web Components, and Polymer. Long ago, Pearl earned a PhD from the University of Wisconsin-Madison, where for five years she taught courses in the Department of Communication Arts.",
      "company" : "Bendyworks",
      "country" : "Madison, WI",
      "featured" : true,
      "id" : 15,
      "name" : "Pearl Latteier",
      "photoUrl" : "/images/people/pearl_latteier.jpg",
      "shortBio" : "Pearl Latteier is a software engineer at Bendyworks in Madison WI, a Google Developer Expert in web technologies, and co-organizer of Madison’s Google Developer Group...",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/pblatteier",
        "name" : "Twitter"
      } ]
    } ],
  "sessions" : {
    "100" : {
      "complexity" : "",
      "description" : "Let your users be the voice talent with Actions on Google. Learn how to design, develop, and distribute rich conversational experiences with Node.js. We’ll show you how to approach voice-driven, natural language interactions with Dialogflow’s powerful bot platform.",
      "id" : 100,
      "speakers" : [ 1, 15 ],
      "tags" : [ "Actions on Google", "JavaScript" ],
      "title" : "Get talking with Actions on Google"
    },
    "101" : {
      "complexity" : "Intermediate",
      "description" : "In this talk, I will provide a short overview of bootstrapping a low cost application leveraging GCP's \"Platform as a Service\" offerings. The focus of the talk will be how to easily leverage many of machine analysis services provided by Google such as Image Analysis, Video Analysis, Speech Analysis and Text Analysis. Time permitting, I'd also like to discuss how GCP's services can help scale from 1 user to 1 million users. ",
      "id" : 101,
      "speakers" : [ 3 ],
      "tags" : [ "GCP", "Cloud", "Machine Learning" ],
      "title" : "Visual Analysis with Google Could Platform"
    },
    "102" : {
      "complexity" : "Intermediate",
      "description" : "Immersive virtual reality (VR), augmented reality (AR), and mixed reality (MR) are becoming mainstream while their software and hardware are rapidly changing.  They introduce new and novel usability issues ranging from high-level project methodology down to detailed design of sensory elements in their user interfaces. They also sometimes affect non-users who are interacting with AR and MR users.   Key questions include defining (a) new usability-design strategies and (b) new procedures and processes for usability testing.  The Five-Finger project life cycle and the GAINS™ design framework provide an approach to answering these questions and designing excellent user interfaces.",
      "id" : 102,
      "speakers" : [ 10 ],
      "tags" : [ "VR", "AR" ],
      "title" : "How to Save Time and Decrease Risk in VR/AR/MR User-Interface Design"
    },
    "103" : {
      "complexity" : "Intermediate",
      "description" : "Most applications have some sort of authentication system. Authentication is a hard problem for any developer. It needs to be safe, secure and easy for the user. In this talk, we will explore the tools provided by the Google Identity platform to help you build frictionless and secure authentication for your application. ",
      "id" : 103,
      "speakers" : [ 5 ],
      "tags" : [ "Identity", "Android" ],
      "title" : "Simplifying Signups with the Google Identity Platform"
    },
    "104" : {
      "complexity" : "Beginner",
      "description" : "Android TV’s home screen has received a makeover with Android Oreo. With this update, users can decide what to watch from multiple apps at once from the home screen. In addition, the Google Assistant is also available for users to discover and control playback of content on their Android TV. We will look at how to surface your app’s content on the home screen by creating channels. We will also examine how to integrate your app with the Google Assistant with MediaSession. ",
      "id" : 104,
      "speakers" : [ 2 ],
      "tags" : [ "TV", "Android" ],
      "title" : "Android TV's new home screen"
    },
    "105" : {
      "complexity" : "Intermediate",
      "description" : "Kotlin has a lot of great features that improve developer productivity and make the overall code base more stable. This all works great when you're entire code base is written in Kotlin. However, while Kotlin adoption is growing by leaps and bounds, the fact is that many applications and libraries are still on Java and will be for some time. This means, if you're a library provider like Realm that 100k+ developers rely on, you must provide an API that works well for both platforms. In this talk, you'll learn about some of the challenges faced and approaches taken by Realm to solve this problem and how you might apply these same approaches to your own libraries. You'll also learn about some of the key Kotlin features they used to simplify Realm Mobile Database development with Kotlin.",
      "id" : 105,
      "speakers" : [ 4 ],
      "tags" : [ "Kotlin", "Android", "Realm" ],
      "title" : "Building Libraries for Kotlin"
    },
    "106" : {
      "complexity" : "Intermediate",
      "description" : "Lombok, Retrofit, Dagger. These project all have one thing in common; they all use Java's annotation API.  Many developers look at these libraries as black magic which is effective but inscrutable.  No more!  In this session developers will learn how they can create their own annotation library in order to reduce boilerplate code and improve the lives of their fellow developers.  We'll shed light on how to create annotations, how to parse the AST using the AbstractProcessor, and how to generate code using the JavaPoet library. By the end of this session developers will come away with a better understanding of how annotations work and how they can create them themselves.",
      "id" : 106,
      "speakers" : [ 6 ],
      "tags" : [ "Java", "Annotations", "AST" ],
      "title" : "Annotation Processing - Demystifying Java's Dark Arts"
    },
    "107" : {
      "complexity" : "Beginner",
      "description" : "This talk will provide a broad overview of some of the most popular machine learning algorithms and techniques. Specific topics may include Decision Trees, Random Forests, Neural Networks, and associated ensemble methods (gradient boosting vs. bagging/bootstrapping). Attendees can expect  a high-level overview of techniques, a review of the circumstances under which they are and aren't appropriate for use, and a brief crash course on how to implement some popular algorithms using open source software.",
      "id" : 107,
      "speakers" : [ 8 ],
      "tags" : [ "Machine Learning" ],
      "title" : "Using Popular Machine Learning Models and Techniques"
    },
    "108" : {
      "complexity" : "Beginner",
      "description" : "The Flutter SDK looks incredibly promising. Let's face it though, not a lot of us are Dart developers. Let's see some of the basics of Dart & Flutter to implement both iOS & Android apps using Firebase as a backend. In this talk, we'll first take a look at Dart, see its similarities & differences compared to Java. Then take a look at what it takes to write an app with one codebase for Android & iOS. Finally we'll pull our conference data into our app using Firebase as our datasource.",
      "id" : 108,
      "speakers" : [ 14 ],
      "tags" : [ "Flutter", "Android", "iOS", "Firebase" ],
      "title" : "Developing iOS and Android apps with Flutter"
    },
    "109" : {
      "complexity" : "Beginner",
      "description" : "Currently, we are in the wave of IoT data collection. We are figuring out ways to attach microchips and sensors to everything to collect as much data possible -- this is solely for one purpose: Machine Learning. The next big part of IoT is learning from all the information we can collect. This talk will cover the process of collecting data from hardware and using TensorFlow to predict future values. With this foundation, one can use these same learnings to build more complex ML & IoT solutions. ",
      "id" : 109,
      "speakers" : [ 9 ],
      "tags" : [ "Tensorflow", "IoT", "Machine Learning" ],
      "title" : "Predicting the Internet of Things With Tensorflow"
    },
    "110" : {
      "complexity" : "Beginner",
      "description" : "Take your build toolchain to the next level by putting all your build tools (gulp, maven, gradle, grunt, make, rake) into a Docker container. In this talk we'll go over the basics of getting started putting your toolchain into Docker, explore a few examples, and talk about common problems you might encounter.",
      "id" : 110,
      "speakers" : [ 12 ],
      "tags" : [ "Docker", "CI" ],
      "title" : "Dockerize Your Build Toolchain"
    },
    "111" : {
      "complexity" : "Beginner",
      "description" : "Google Home is a voice-activated speaker powered by the Google Assistant. While the Assistant is good at answering general questions, you can make Google Home even smarter by building your own app for it and publishing that app to the world. In this session we will go through the steps to do just that, including how to tune the AI, starting from a blank slate.",
      "id" : 111,
      "speakers" : [ 1 ],
      "tags" : [ "Actions on Google", "Android", "Google Assistant", "AI" ],
      "title" : "Build your own app for Google Home"
    },
    "112" : {
      "complexity" : "Intermediate",
      "description" : "At first glance, visualizing data in JavaScript seems too daunting to approach. Fortunately there are open source JavaScript libraries which help developers create compelling visualizations. We will talk about D3.js, DC.js and CrossFilter.js.",
      "id" : 112,
      "speakers" : [ 11 ],
      "tags" : [ "Web", "JavaScript", "Data Science" ],
      "title" : "Feed your inner data scientist: JavaScript tools for data visualization and filtering."
    },
    "114" : {
      "complexity" : "Intermediate",
      "description" : "This talk will provide a broad overview of some of the most popular machine learning algorithms and techniques. Specific topics may include Decision Trees, Random Forests, Neural Networks, and associated ensemble methods (gradient boosting vs. bagging/bootstrapping). Attendees can expect a high-level overview of techniques, a review of the circumstances under which they are and aren't appropriate for use, and a brief crash course on how to implement some popular algorithms using open source software.",
      "id" : 114,
      "speakers" : [ 7 ],
      "tags" : [ "Machine Learning", "Data Science" ],
      "title" : "Genomic Data Science and Personalized Medicine"
    },
    "115" : {
      "complexity" : "Beginner",
      "description" : "Getting new features (and bug fixes) into the hands of your users is an important part of the app lifecycle. Scripting and automation can help you get the most of your submission process by ensuring efficiency and stability when shipping new versions of your app. This talk will cover several tips and tricks to trim your submission/release process down to a reliable and reproducible set of commands.",
      "id" : 115,
      "speakers" : [ 13 ],
      "tags" : [ "Android", "CI" ],
      "title" : "Ship It Faster: Making the Most of Mobile App Submission"
    },
    "200" : {
      "complexity" : "Beginner",
      "description" : "Check-in, grab some breakfast, visit our partners' booths, and socialize.",
      "id" : 200,
      "speakers" : [ ],
      "tags" : [ "General", "Food" ],
      "title" : "Check-in & Breakfast"
    },
    "201" : {
      "complexity" : "Beginner",
      "description" : "",
      "id" : 201,
      "speakers" : [ ],
      "tags" : [ "General", "Food" ],
      "title" : "Lunch"
    },
    "202" : {
      "complexity" : "Beginner",
      "description" : "Open forum Q&A with all Ohio DevFest speakers",
      "id" : 202,
      "speakers" : [ ],
      "tags" : [ "General" ],
      "title" : "Fireside Chat"
    },
    "203" : {
      "complexity" : "Beginner",
      "description" : "Hands on coding lab for Actions on Google. More details to come!",
      "id" : 203,
      "speakers" : [ 1, 15 ],
      "tags" : [ "Actions on Google", "Code Lab", "Google Assistant", "Android" ],
      "title" : "Actions on Google Code Lab"
    },
    "204" : {
      "complexity" : "Beginner",
      "description" : "Hands on coding lab for Actions on Google. More details to come!",
      "id" : 203,
      "speakers" : [ 1, 15 ],
      "tags" : [ "Actions on Google", "Code Lab", "Google Assistant", "Android" ],
      "title" : "Actions on Google Code Lab (continued)"
    },
    "205" : {
      "complexity" : "Beginner",
      "description" : "We don't want Ohio DevFest to end! Let's keep the fun going. Join us at Zaftig Brewing Company (7020 A Huntley Road, Worthington, OH 43229) for food, beer, and socializing! Everyone is invited! Under 21 food and beverages available. Proper ID and wristbands will be required for alcohol consumption. Please drink responsibly!",
      "id" : 205,
      "speakers" : [ ],
      "tags" : [ "General", "Food"],
      "title" : "After Party"
    }
  },
  "schedule" : [ {
    "date" : "2017-11-18",
    "dateReadable" : "November 18",
    "timeslots" : [ {
      "endTime" : "09:00",
      "sessions" : [ [ 200 ] ],
      "startTime" : "07:30"
    }, {
      "endTime" : "09:50",
      "sessions" : [ [ 100 ] ],
      "startTime" : "09:00"
    }, {
      "endTime" : "10:50",
      "sessions" : [ [ 104 ], [ 110 ], [ 114 ] ],
      "startTime" : "10:00"
    }, {
      "endTime" : "11:50",
      "sessions" : [ [ 115 ], [ 102 ], [ 109 ] ],
      "startTime" : "11:00"
    }, {
      "endTime" : "13:00",
      "sessions" : [ [ 201 ] ],
      "startTime" : "12:00"
    }, {
      "endTime" : "13:50",
      "sessions" : [ [ 105 ], [ 112 ], [ 203 ] ],
      "startTime" : "13:00"
    }, {
      "endTime" : "14:50",
      "sessions" : [ [ 108 ], [ 101 ], [ 204 ] ],
      "startTime" : "14:00"
    }, {
      "endTime" : "15:50",
      "sessions" : [ [ 106 ], [ 103 ], [ 107 ] ],
      "startTime" : "15:00"
    }, {
      "endTime" : "17:00",
      "sessions" : [ [ 202 ] ],
      "startTime" : "16:00"
    }, {
      "endTime" : "21:00",
      "sessions" : [ [ 205 ] ],
      "startTime" : "18:00"
    } ],
    "tracks" : [ {
      "title" : "Room 1"
    }, {
      "title" : "Room 2"
    }, {
      "title" : "Room 3"
    } ]
  } ],
  "team" : [ {
    "members" : [ {
      "name" : "Casey Borders",
      "photoUrl" : "../images/people/casey_borders.jpg",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/thebeast13",
        "name" : "Twitter"
      }, {
        "icon" : "gplus",
        "link" : "https://plus.google.com/+CaseyBorders",
        "name" : "Google+"
      } ],
      "title" : "GDG Columbus Organizer"
    }, {
      "name" : "Pete Gordon",
      "photoUrl" : "../images/people/pete_gordon.png",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/petegordon",
        "name" : "Twitter"
      }, {
        "icon" : "gplus",
        "link" : "https://plus.google.com/+PeteGordonUSA",
        "name" : "Google+"
      } ],
      "title" : "GDG Columbus Organizer"
    }, {
      "name" : "Patrick Hammond",
      "photoUrl" : "../images/people/patrick_hammond.jpg",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/patrickhammond",
        "name" : "Twitter"
      }, {
        "icon" : "gplus",
        "link" : "https://plus.google.com/+PatrickHammond",
        "name" : "Google+"
      } ],
      "title" : "GDG Cincinnati Organizer"
    }, {
      "name" : "James Power",
      "photoUrl" : "../images/people/james_power.jpg",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/powerje",
        "name" : "Twitter"
      }, {
        "icon" : "gplus",
        "link" : "https://plus.google.com/+JamesPower",
        "name" : "Google+"
      } ],
      "title" : "GDG Columbus Organizer"
    }, {
      "name" : "Greg Williams",
      "photoUrl" : "../images/people/greg_williams.png",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/g_willi",
        "name" : "Twitter"
      }, {
        "icon" : "gplus",
        "link" : "https://plus.google.com/116224595242016943891",
        "name" : "Google+"
      } ],
      "title" : "GDG Cincinnati Organizer"
    }, {
      "name" : "David Straight",
      "photoUrl" : "../images/people/david_straight.jpg",
      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/davidstr8",
        "name" : "Twitter"
      } ],
      "title" : "Logo Design"
    } ],
    "title" : "Core Team"
  } ],
  "tickets" : {
    "elements" : [ {
      "currency" : "$",
      "ends" : "October 18",
      "info" : "Requires valid student ID",
      "name" : "EarlyBird Student",
      "price" : 20,
      "soldOut" : true,
      "starts" : "September 11"
    }, {
      "currency" : "$",
      "ends" : "October 18",
      "name" : "EarlyBird Professional",
      "price" : 40,
      "soldOut" : true,
      "starts" : "September 11"
    }, {
      "currency" : "$",
      "ends" : "November 18",
      "info" : "Requires valid student ID",
      "name" : "Student",
      "price" : 30,
      "soldOut" : false,
      "starts" : "October 19"
    }, {
      "currency" : "$",
      "ends" : "November 18",
      "name" : "Professional",
      "price" : 50,
      "soldOut" : false,
      "starts" : "October 19"
    } ],
    "url" : "https://www.eventbrite.com/e/ohio-devfest-2017-tickets-37510713554"
  }
}
