[
  {
    "id": 101,
    "title": "TBD",
    "description": "",
    "speakers": [1],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": ""
  },
  {
    "id": 102,
    "title": "TBD",
    "description": "",
    "speakers": [2],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": ""
  },
  {
    "id": 103,
    "title": "Planning Android Screens",
    "description": "This talks is about Android UX when building new screen from scratch. We will go through some common Android screens (like Login / Sign Up / Search / etc.) and see what issues you can face, how popular apps are solving them and what are our options. At the end I will show how to plan & prototype animations with Pixate Studio.",
    "speakers": [3],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": ""
  },
  {
    "id": 104,
    "title": "Power of Android Shell",
    "description": "Android provides a set of not really well documented command line tools that are mainly used by system engineers for debugging and testing purposes. Available after entering 'adb shell', these tools can give you a lot of details about what is happening in the system and help with automation. <br/><br/>We'll see what is available in Android command line and <br/>- analyze system and sample apps with 'dumpsys', <br/>- find out how to check whether your service finishes normally and does not live forever, <br/>- mock battery level and charger state, <br/>- trigger account sychronization, <br/>- change system settings without a single line of UiAutomator code.",
    "speakers": [4],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "",
    "video": ""
  },
  {
    "id": 105,
    "title": "Hijacking notification actions - lets respond to your messages!",
    "description": "Always wanted to implement automatic answer to your text messages/FB Messenger/Telegram and didn't want to implement whole client for this? <br/><br/>Wanted to call some action in any notification from your app without too much permissions (or root access)? <br/><br/>Here we go! I will show and explain how to hijack actions from any visible notification to any other app.",
    "speakers": [5],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "",
    "video": ""
  },
  {
    "id": 106,
    "title": "TBD",
    "description": "",
    "speakers": [6],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": ""
  },
  {
    "id": 107,
    "title": "Angular2: Reasoning behind technical decisions",
    "description": "TBD",
    "speakers": [7],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": ""
  },
  {
    "id": 108,
    "title": "V8 under the hood",
    "description": "What is happening inside V8 javascript engine - optimization, work, etc.",
    "speakers": [8],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "",
    "video": ""
  },
  {
    "id": 109,
    "title": "Scalable Microservices with gRPC, Kubernetes, and Containers",
    "description": "Microservices and Containers are a great mix, but if you want to get serious about using them together then you need to start shopping for a Cluster Management and Container Orchestration Platform. It just so happens there's already an extremely popular, Open Source, Cross Cloud Platform called Kubernetes. You'll also need something to wire them together, maybe something that offers high performance RPCs, but also provides a toolset to generate services and clients in multiple languages. gRPC is a language and platform-neutral RPC framework, based on HTTP/2 and Protobuf, used to build highly performant and scalable APIs. <br/><br/>In this talk, we’ll demo the core concepts of gRPC and Kubernetes, and show you how to combine these two technologies to create scalable and performant microservices rooted in lessons learned from Google’s experience!",
    "speakers": [9],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": ""
  },
  {
    "id": 110,
    "title": "Redefining PaaS: Managed container based apps on Google App Engine",
    "description": "Are you building the next big idea?  Are you part of a team that is focused on streamlined dev/test/production deployments?  Are you a bit more “dev” than “ops”?  If so, be sure to come by and check out this talk that focuses on maximizing developer productivity through the use of microservice based architectures and container technology in conjunction with Google App Engine. <br/><br/>We'll look at new and enhanced features of App Engine and walk through the staged deployment of both a simple application and a more complicated microservices based architecture. We'll also look at how App Engine has evolved from it's original sandboxed runtime environment to what it is today, a next generation platform for building and deploying modern day applications.",
    "speakers": [9],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": ""
  },
  {
    "id": 111,
    "title": "New security model in Marshmallow",
    "description": "",
    "speakers": [10],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": ""
  },
  {
    "id": 112,
    "title": "Android Studio 1.3 with C/C++ ",
    "description": "TBD",
    "speakers": [11],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": ""
  },
  {
    "id": 113,
    "title": "Material Design Magic",
    "description": "1. Material Design Magic <br/>2. Work with colours, typography and custom branding <br/>3. Frameworks for MD Style <br/>4. Issues, tricks and Best cases.",
    "speakers": [12],
    "language": "ua",
    "complexity": "Intermediate",
    "presentation": "",
    "video": ""
  },
  {
    "id": 114,
    "title": "Continuous Delivery with Ease",
    "description": "Do you create builds for your client frequently? Maybe every day? That’s good, because you can get feedback early and often… unless you do that manually, pushing APKs via mail or to some app testing platform via browser. Look back at the time spent on these tedious tasks. How would you feel if you could spend less time and do even more at the same time? I will show you, how easy it is to set things up, not to spend even a minute a day to create builds for your testers. We will look at all the requirements for that and we will go as far as enabling business people to decide when to publish new version of your amazing application literally with a push of a button.",
    "speakers": [13],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "",
    "video": ""
  },
  {
    "id": 115,
    "title": "Let's play Dart!",
    "description": "Dart is a language for the web by Google which is object oriented with optional types. You can use Dart to build great apps for the client-side, server-side and command line. <br/><br/>Come to listen to my story why I love Dart and why it makes me so much productive!",
    "speakers": [14],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "",
    "video": ""
  },
  {
    "id": 116,
    "title": "Polymer vs other libraries",
    "description": "Most modern front-end JavaScript libraries provide support for component based development. Components help separate large applications into standalone building blocks with specified communication API. Let's compare Polymer elements with components from React, Angular, Ember and Backbone.",
    "speakers": [15],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "",
    "video": ""
  },
  {
    "id": 117,
    "title": "Bluetooth Low Energy and iBeacon development for Android",
    "description": "iBeacon is a new technology created by Apple. iBeacon uses a Bluetooth low energy signal, which Android 4.3+ devices can detect. Some fairly significant improvements were announced at Google I/O 2014 for improved BLE support in Android Lollipop. We will discuss different implementations for devices prior to 5.0, and for 5.0 and higher.  During our talk you will learn how to implement background beacon scanning, how to improve battery life (and how to choose between fast beacon detection and longer battery life). Also we'll discuss, on how to turn your android device into multiple iBeacon transmitters. Allowing a single Android device to act as multiple iBeacons opens up a huge number of interesting possibilities.",
    "speakers": [16],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "",
    "video": ""
  },
  {
    "id": 118,
    "title": "Students & Google: how not to vanish in the crowd",
    "description": "Most students believe that getting a job at Google is some kind of 'Mission Impossible'. Fortunately, you don't need superpower for this. In her talk Anna will tell you about the opportunities for students at Google and will share some tips on how to apply, keep calm and succeed.",
    "speakers": [17],
    "language": "uk",
    "complexity": "Beginner",
    "presentation": "",
    "video": ""
  }
]
