[
  {
    "text": "The best conference I have attended for last time - passionate developers and speakers, coding and discussions during two days",
    "author": {
      "name": "Kseniia Shumelchyk"
    }
  },
  {
    "text": "It was a best DevFest I ever attended. So professional, so much enthusiasm from the community. You managed to bring the vibe of Google I/O to Ukraine.",
    "author": {
      "name": "David Vávra"
    }
  },
  {
    "text": "You gave me sense of belonging and I really felt the integrated part of this happy holiday",
    "author": {
      "name": "Yonatan Levin"
    }
  },
  {
    "text": "It's my third GDG DevFest in Lviv and each year it becomes better and better! Excellent organization, interesting people, fun parties - it's all about DevFest",
    "author": {
      "name": "Michael Pustovit"
    }
  },
  {
    "text": "It was my first DevFest in Ukraine and till now, it's the best DevFest I've ever been. So many people at the event, so many positive energy, so many talks. The organisation was outstanding. ",
    "author": {
      "name": "Anonymous"
    }
  },
  {
    "text": "One of the best conferences I've ever been. Amazing atmosphere, great presentations and workshops, awesome party and lot of fun.",
    "author": {
      "name": "Jakub Skvara"
    }
  },
  {
    "text": "I've been to conferences all over the world and what you've created in Lviv is world class. It's easily first league of conferences.",
    "author": {
      "name": "Piotr Tuszynski"
    }
  },
  {
    "text": "This was a top notch event! Great organisation and energy at the conference, good topics, a lot of attendees and a fun party",
    "author": {
      "name": "Mete Atamel"
    }
  },
  {
    "text": "Dev Fest Lviv definitely deserves the name. It was a huge and cozy festival packed with great talks, great attendees and great organizers.",
    "author": {
      "name": "Sascha Wolter"
    }
  },
  {
    "text": "DevFest Ukraine is one of the best conferences I've had a chance to attend. It incredibly well organized, audience is curious and engaged and, thanks to the beautiful city of Lviv, the whole thing has unique climate.",
    "author": {
      "name": "Konrad Dzwinel"
    }
  },
  {
    "text": "GDG DevFest in Lviv is one of or probably the best IT conference in Ukraine. It's an event where you can meet your idols and spend time with benefit and interest.",
    "author": {
      "name": "Dmytro Zaitsev"
    }
  }
]
