{
  "speakers" :
  [
    {
      "id":"sandi_metz",
      "featured": true,
      "bio" : "Sandi Metz, author of Practical Object-Oriented Design in Ruby and 99 Bottles of OOP, believes in simple code and straightforward explanations. She prefers working software, practical solutions and lengthy bicycle trips (not necessarily in that order) and writes, consults, and teaches about object-oriented design.",
      "name" : "Sandi Metz",
      "company":"",
      "country": "USA",
      "photo" : "/images/speakers/sandimetz_2016.jpg",
      "photoUrl" : "/images/speakers/sandimetz_2016.jpg",
      "socials" : [
        {
          "icon" : "twitter",
          "link" : "https://twitter.com/sandimetz",
          "name" : "Twitter"
        },
      {
        "icon" : "website",
          "link" : "https://www.sandimetz.com/",
          "name" : "Website"
      }
    ],
      "order" : 0,
      "title" : "Programmer / Author / Teacher",
      "sessions":[
        {
          "id": "insufficientlyPersuasive"
        }
      ]
    },
    {
      "id":"guillaume_marty",
      "featured": true,
      "bio" : "Guillaume Marty has been working on the web for 77% of its lifespan. In the last few years he shifted his focus from code to humans. He's passionate about contributing to a healthy, inclusive industry, and the intersection between communities and technology. He was formerly working at Mozilla, and currently at Twitter.",
      "name" : "Guillaume Marty",
      "company": "Twitter",
      "country": "United Kingdom",
      "photo" : "/images/speakers/guillaume-marty.jpg",
      "photoUrl" : "/images/speakers/guillaume-marty.jpg",
      "socials" : [
        {
          "icon" : "twitter",
          "link" : "https://twitter.com/g_marty",
          "name" : "Twitter"
        }
    ],
      "order" : 0,
      "title" : "Web lover / JavaScript activist / HTML5 enthusiast"
    },
    {
      "id":"andrew_murphy",
      "featured": false,
      "bio" : "I combine my 13 years of professional software engineering experience with a passion for leadership and communication skills. My main focus is on how we can be better technical leaders and developers by focusing on learning the skills most of us ignore - communication and leadership skills. Originally from the UK but now based in Australia, I have consulted, performed workshops and developed software for clients across the UK, Australia, New Zealand and the United States. Technology in all its forms is part of my makeup and so I code, speak, write, teach, make, game and listen to all things geek",
      "name" : "Andrew Murphy",
      "company":"",
      "country": "Melbourne, Australia",
      "photo" : "/images/speakers/Andrew_Murphy.jpg",
      "photoUrl" : "/images/speakers/Andrew_Murphy.jpg",
      "socials" : [
    ],
      "order" : 0,
      "title" : "",
      "sessions":[
        {
          "id": "iDontKnow"
        }
      ]
    },
    {
      "id":"ryan_heupler",
      "featured": false,
      "bio" : "Hi there! I’m currently an engineer at Guru, as well as mentor/instructor for an online code school called Thinkful. I run my own YouTube channel focused on helping break down programming concepts into simple terms (or at least I try to!). When I’m not working on any of that, I’ll sometime stream on Twitch where I do portfolio reviews for people looking for jobs. I’ll sometime mess around making music, or hangout at a local coffee shop (trying to find the best coffee in Philadelphia).",
      "name" : "Ryan Heupler",
      "company":"",
      "country": "Philadelphia, PA USA",
      "photo" : "/images/speakers/Ryan_Heupler.jpg",
      "photoUrl" : "/images/speakers/Ryan_Heupler.jpg",
      "socials" : [
        {
          "icon" : "twitter",
          "link" : "http://twitter.com/codingcardio",
          "name" : "Twitter"
        },
      {
        "icon" : "website",
          "link" : "https://youtube.com/c/codingcardio",
          "name" : "Website"
      }
    ],
      "order" : 0,
      "title" : "Mentor & Instructor",
      "sessions":[
        {
          "id": "refactorClassComponent"
        }
      ]
    },
    {
      "id":"chris_lorenzo",
      "featured": false,
      "bio" : "Chris has worked at Comcast since 2007 – currently as a Distinguished Engineer. He enjoys building/motivating teams and ramping up new projects using the latest patterns and web primitives. Besides coding in Javascript, he loves spending time with his family and helping out in the community.",
      "name" : "Chris Lorenzo",
      "company":"",
      "country": "Philadelphia, PA USA",
      "photo" : "/images/speakers/Chris_Lorenzo.jpg",
      "photoUrl" : "/images/speakers/Chris_Lorenzo.jpg",
      "socials" : [
        {
          "icon" : "twitter",
          "link" : "http://twitter.com/chiefcll",
          "name" : "Twitter"
        },
      {
        "icon" : "website",
          "link" : "https://www.linkedin.com/in/chris-lorenzo-3323667",
          "name" : "Website"
      }
    ],
      "order" : 0,
      "title" : "Distinguished Engineer at Comcast",
      "sessions":[
        {
          "id": "sharingComponents"
        }
      ]
    }
  ],
  "sessions" : [
    {
      "id":"insufficientlyPersuasive",
      "complexity" : "Intermediate",
      "description" : "Research indicates that programmers are not entirely happy, and that much of this unhappiness arises from interactions with other people.  Research also tells us that teams are capable of producing solutions that are more creative and of higher quality than those of single individuals.  However, teams, by definition, consist of people--possibly the very ones who are causing our unhappiness.<br><br>This talk explores the science behind human persuasion, examines the roots of motivation, and reveals the single quality that all high-performing teams share.  You’ll leave armed to persuade, primed to understand, and motivated to create teams that inspire everyone to do their best work.",
      "speakers" : [ "sandi_metz" ],
      "tags" : [ "Keynote" ],
      "title" : "You Are Insufficiently Persuasive"
    },
    {
      "id":"iDontKnow",
      "complexity" : "All",
      "description" : "It’s something we all struggle with, admitting we don’t know something. But I’m here to show you the power of saying \"I don’t know\" to people. Saying \"I don’t know\" doesn’t have to be the end of a conversation, in fact it can be the start of an entirely new, exciting conversation with learning opportunities for all parties. We will talk through scenarios where we don’t feel comfortable saying it, ways we can feel comfortable saying it, and the good things that come from it. Outline/structure of the Session Why we don’t say I don’t know Why we should say it How to say I don’t know to clients How to say I don’t know as an expert How to say I don’t know as a leader A deep (and revealing) discussion on the underlying reasons why we feel afraid to say \"I don’t know\" to people.",
      "speakers" : [ "andrew_murphy" ],
      "tags" : [ "talk", "communication", "ledership" ],
      "title" : "The power of saying \"I don't know\""
    },
    {
      "id":"refactorClassComponent",
      "complexity" : "All",
      "description" : "Ever since Hooks was announced for React, they’ve become a very popular buzz word when discussing React. Some common questions I hear when talking to others are: What are they? How do you use them? Why should I use them? Do they replace life-cycle methods. We will go over all of these together. I will start with a basic React app using a few stateful, class components using life-cycle, custom methods, and API interaction. I will convert the components over to functional components and integrating several different hooks, while not losing any functionality.You’ll come away from this talk with a good foundation for most of the primitive hooks in React, and you’ll understand how to use them & write your own custom hooks.",
      "speakers" : [ "ryan_heupler" ],
      "tags" : [ "talk", "react", "front-end", "optimization", "framework", "functional programming"],
      "title" : "Refactoring a Class Component: A Gentle Introduction into React Hooks"
    },
    {
      "id":"sharingComponents",
      "complexity" : "All",
      "description" : "Faster, Better, Cheaper - the beating drum for software developers. Do you work in a large shop where teams are using Angular, Vue and React? With the multitude of frontend frameworks today, how do you share components between them? How do you build things once? Is it worth it? This talk will cover how Comcast front end teams are tackling these challenges. We’ll look at how we’re using Web Components to share code between sites and if they can be used to share components between frameworks. I’ll go over how we’re sharing data between codebases with Redux. Lastly we’ll talk about Shared Flows; pulling out complicated reusable logic into its own microsite. You’ll walk away learning from our experiences and being able to revisit how you build software to reuse code.",
      "speakers" : [ "chris_lorenzo" ],
      "tags" : ["Javascript", "components", "frontend"],
      "title" : "Strategies for Sharing Components ⚙"
    }
  ]

}
